benchmarkCases/two-sided-deflector/kOmegaSST/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U  (0.01 0 0)
);

regions
(
    boxToCell
    {
        box (0 0.02 -1) (100 100 8.5);
        fieldValues
        (
            volVectorFieldValue U  (-0.01 0 0)
        );
    }


);

// ************************************************************************* //
